results/ab.out
RZBLAN+WZHIOBA@ATC104184 MINGW64 /c/Program_dev/Apache24/bin
$ ./ab.exe -n 10000 -c 10 -l http://localhost:8771/feignshop/orderPizza/
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            8771

Document Path:          /feignshop/orderPizza/
Document Length:        Variable

Concurrency Level:      10
Time taken for tests:   52.971 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      3
Total transferred:      1780353 bytes
HTML transferred:       650335 bytes
Requests per second:    188.78 [#/sec] (mean)
Time per request:       52.971 [ms] (mean)
Time per request:       5.297 [ms] (mean, across all concurrent requests)
Transfer rate:          32.82 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   2.3      1      73
Processing:     4   51  63.8     30    1092
Waiting:        4   50  63.9     28    1091
Total:          5   53  63.8     31    1093

Percentage of the requests served within a certain time (ms)
  50%     31
  66%     47
  75%     61
  80%     74
  90%    111
  95%    159
  98%    233
  99%    300
 100%   1093 (longest request)

RZBLAN+WZHIOBA@ATC104184 MINGW64 /c/Program_dev/Apache24/bin
$ ./ab.exe -n 10000 -c 10 -l http://localhost:8771/feignshop/orderBeer/
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            8771

Document Path:          /feignshop/orderBeer/
Document Length:        Variable

Concurrency Level:      10
Time taken for tests:   29.505 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1739771 bytes
HTML transferred:       609771 bytes
Requests per second:    338.93 [#/sec] (mean)
Time per request:       29.505 [ms] (mean)
Time per request:       2.950 [ms] (mean, across all concurrent requests)
Transfer rate:          57.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.9      1      36
Processing:     5   28  20.7     22     282
Waiting:        4   27  20.8     21     281
Total:          6   29  20.8     24     283

Percentage of the requests served within a certain time (ms)
  50%     24
  66%     29
  75%     34
  80%     38
  90%     52
  95%     69
  98%     93
  99%    113
 100%    283 (longest request)

RZBLAN+WZHIOBA@ATC104184 MINGW64 /c/Program_dev/Apache24/bin
$ ./ab.exe -n 10000 -c 10 -l http://localhost:8771/resttemplateshop/orderPizza/
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            8771

Document Path:          /resttemplateshop/orderPizza/
Document Length:        Variable

Concurrency Level:      10
Time taken for tests:   37.011 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1849635 bytes
HTML transferred:       719635 bytes
Requests per second:    270.19 [#/sec] (mean)
Time per request:       37.011 [ms] (mean)
Time per request:       3.701 [ms] (mean, across all concurrent requests)
Transfer rate:          48.80 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   1.1      1      59
Processing:     4   36  33.7     27     950
Waiting:        4   35  33.8     26     950
Total:          5   37  33.7     28     953

Percentage of the requests served within a certain time (ms)
  50%     28
  66%     37
  75%     44
  80%     50
  90%     67
  95%     86
  98%    122
  99%    160
 100%    953 (longest request)

RZBLAN+WZHIOBA@ATC104184 MINGW64 /c/Program_dev/Apache24/bin
$ ./ab.exe -n 10000 -c 10 -l http://localhost:8771/resttemplateshop/orderBeer/
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            8771

Document Path:          /resttemplateshop/orderBeer/
Document Length:        Variable

Concurrency Level:      10
Time taken for tests:   23.875 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1809557 bytes
HTML transferred:       679557 bytes
Requests per second:    418.84 [#/sec] (mean)
Time per request:       23.875 [ms] (mean)
Time per request:       2.388 [ms] (mean, across all concurrent requests)
Transfer rate:          74.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.7      1      18
Processing:     4   22  18.9     18     393
Waiting:        4   21  19.0     17     393
Total:          5   24  18.9     20     394

Percentage of the requests served within a certain time (ms)
  50%     20
  66%     23
  75%     26
  80%     29
  90%     36
  95%     46
  98%     69
  99%     93
 100%    394 (longest request)